---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotRemoveGroupMemberConstraint
source: html/d32ab502-2c34-a7d9-ae88-f275337a02e5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotRemoveGroupMemberConstraint Property

Constraints between group members cannot be removed or excluded from the group.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRemoveGroupMemberConstraint { get; }
```